<br>abstrait<br><br>absurde<br><br>accord<br><br>analyse<br><br>anarchie<br>        Comme la d&eacute;mocratie, l'anarchie est incompl&egrave;te ou inconsistante.<br>Si rien n'est interdit, il n'est pas interdit d'interdire et l'anarchie<br>s'effondre. S'il est interdit d'interdire, l'anarchie est limit&eacute;e.<br>La nature a horreur du vide. Dans les pays o&ugrave; le pouvoir politique s'effondre,<br>le vide politique est vite rempli par des bandes arm&eacute;es qui font r&eacute;gner leur<br>loi.<br><br>art<br>        A quoi sert l'art ? S'il ne servait &agrave; rien, cela signifierait que <br>c'est quelque chose d'important car on le fait pour lui-m&ecirc;me en tant que<br>but en soi et non pour un autre but.  <br>        L'art a une utilit&eacute; psychotrope car il nous met dans un &eacute;tat mental<br>ad&eacute;quat pour exercer d'autres activit&eacute;s.<br><br>autre<br><br>avoir<br>        On peut perdre tout ce qu'on a beaucoup plus facilement qu'on l'a<br>acquis. Les acquis les plus solides sont ceux qu'on risque peu de perdre.<br>Par exemple les oeuvres que l'on a cr&eacute;&eacute;es et diffus&eacute;es assez largement.<br><br>bien, mal<br>        "O&ugrave; est le bien, o&ugrave; est le mal ? Pour moi, le bien c'est ce que <br>je veux."<br>        Fant&ocirc;mas.<br><br><br>boucle<br><br>certitude<br><br>choix<br><br>complexit&eacute;<br><br>conscience<br><br>d&eacute;mocratie<br>        <!-- Toute d&eacute;mocratie est n&eacute;cessairement incompl&egrave;te ou inconsistante, <br>de m&ecirc;me que toute th&eacute;orie math&eacute;matique selon le th&eacute;or&egrave;me de G&ouml;del. <br>La d&eacute;mocratie consiste &agrave; faire ce que veut la majorit&eacute;. Mais que faire si<br>la majorit&eacute; est contre la d&eacute;mocratie ? Si on applique strictement le principe<br>de la d&eacute;mocratie, on doit alors l'abolir. Si on veut la pr&eacute;server, on doit<br>la limiter en d&eacute;cidant qu'elle ne s'applique pas au principe de la d&eacute;mocratie<br>lui-m&ecirc;me. Mais on remet alors en cause son fondement : quand on n'est pas<br>d'accord, plut&ocirc;t que de se battre, on compte combien on est dans chaque camp, <br>et les plus nombreux sont d&eacute;clar&eacute;s vainqueurs sans combat. --><br>        Que faire quand on n'est pas d'accord sur la conduite des affaires <br>d'une soci&eacute;t&eacute; ? On peut se battre et les plus forts feront ce qu'ils veulent<br>mais on aura pris des coups. Les plus forts &eacute;tant probablement les plus<br>nombreux, on peut aussi compter combien on est dans chaque camp et d&eacute;clarer <br>les plus nombreux vainqueurs sans combat. C'est le fondement de la d&eacute;mocratie.<br>Mais que faire si la majorit&eacute; est contre la d&eacute;mocratie ? Si on applique <br>strictement le principe de la d&eacute;mocratie, on doit alors l'abolir. <br>Si on veut la pr&eacute;server, on doit la limiter en d&eacute;cidant qu'elle ne s'applique pas au principe de la d&eacute;mocratie<br>lui-m&ecirc;me. Mais on remet alors en cause son fondement et on en revient au<br>combat. C'est ce qui s'est pass&eacute; en Alg&eacute;rie : quand les islamistes ont gagn&eacute;<br>les &eacute;lections, le pouvoir les a annul&eacute; et le pays a bascul&eacute; dans la guerre civile.<br>Toute d&eacute;mocratie est n&eacute;cessairement incompl&egrave;te ou inconsistante, <br>de m&ecirc;me que toute th&eacute;orie math&eacute;matique selon le th&eacute;or&egrave;me de G&ouml;del. <br><br>esprit<br><br>id&eacute;e<br><br>imagination<br><br>inconscient<br><br>ind&eacute;terminisme<br><br>infini<br><br>information<br><br>intelligence<br>        Capacit&eacute; de percevoir des r&eacute;gularit&eacute;s.<br>        Capacit&eacute; de d&eacute;crire quelque chose dans un langage par une expression <br>la plus courte possible en utilisant les r&eacute;gularit&eacute;s per&ccedil;ues pour compresser<br>les donn&eacute;es brutes.<br>        L'intelligence est une activit&eacute; cr&eacute;atrice non m&eacute;canisable qui permet de <br>transcender les limitations du th&eacute;or&egrave;me de G&ouml;del, qui d&eacute;montre qu'un syst&egrave;me <br>formel fini ne permet pas de g&eacute;n&eacute;rer toutes les v&eacute;rit&eacute;s de l'arithm&eacute;tique.<br>Un syst&egrave;me formel quelconque S0, s'il n'est pas inconsistant, est n&eacute;cessairement<br>incomplet. On peut le rendre moins incomplet en lui ajoutant en axiome une v&eacute;rit&eacute; <br>non d&eacute;montrable, par exemple en utilisant un principe de r&eacute;flexion <br>        Pour tout n, dem (d, [p(n)]) => p(n)) (principe de r&eacute;flexion uniforme de Feferman)<br>        Pour tout d, eval (concl (d))<br>        Pour tout d, eval (gauche (d)) = eval (droit (d))<br>o&ugrave; <br>        d est le nombre de G&ouml;del codant une d&eacute;monstration, <br>        dem (d, p) signifi que d est le nombre de G&ouml;del d'une d&eacute;monstration <br>dont la conclusion est une proposition de nombre de G&ouml;del p,<br>        [p] est le nombre de G&ouml;del de p<br><br>        On obtient ainsi un syst&egrave;me S1 qui est lui aussi un syst&egrave;me formel <br>fini auquel le th&eacute;or&egrave;me de G&ouml;del s'applique &agrave; nouveau. On peut r&eacute;it&eacute;rer le <br>m&ecirc;me proc&eacute;d&eacute; en appliquant un principe de r&eacute;flexion &agrave; S1 pour obtenir un<br>syst&egrave;me S2 et ainsi de suite. On obtient une suite de syst&egrave;mes S0, S1, S2, ...<br>qu'on peut englober dans un syst&egrave;me S omega, qui est lui aussi un syst&egrave;me fini<br>auquel on peut appliquer le principe de r&eacute;flexion pour obtenir un syst&egrave;me <br>S omega+1, et ainsi de suite. On a donc une suite transfinie de syst&egrave;mes <br>formels. Solomon Feferman a d&eacute;montr&eacute; que l'it&eacute;ration transfinie du principe de r&eacute;flexion <br>uniforme permet d'acc&eacute;der &agrave; toutes les v&eacute;rit&eacute;s arithm&eacute;tiques.<br>        Mais l'intelligence cr&eacute;ative est n&eacute;cessaire pour produire cette<br>        it&eacute;ration transfinie c'est &agrave; dire pour produire la suite des ordinaux transfinis,<br>car la d&eacute;tection de r&eacute;gularit&eacute;s permet de r&eacute;aliser qu'on est dans un processus<br>r&eacute;gulier et qu'il faut passer &agrave; la limite et &eacute;viter ainsi de rester bloqu&eacute; en dessous<br>d'un certain ordinal. Il faut, par exemple, se rendre compte de la<br>r&eacute;gularit&eacute; de la suite 0, omega, omega*2, omega*3 ... pour passer &agrave; la limite<br>omega^2 et continuer au del&agrave; de cette limite.<br><br><br><br><br>je, moi<br><br>libert&eacute;<br><br>math&eacute;matique<br>        Etude de rien. <br>        L'ensemble vide est inclus dans tous les ensembles.<br>        Les math&eacute;matiques peuvent s'appliquer &agrave; tous les<br>domaines.<br>        Les v&eacute;rit&eacute;s math&eacute;matiques sont vraies dans notre monde<br>et dans tous les mondes possibles, et resteraient vraies m&ecirc;me<br>s'il n'y avait pas de monde, mais les domaines des math&eacute;matiques <br>utiles pour d&eacute;crire un certain monde peuvent d&eacute;pendre de ce monde.<br><br>modification<br><br>n&eacute;gation<br><br>relation<br><br>