<HTML><HEAD><TITLE>Exp&eacute;riences de sortie hors du corps</TITLE></HEAD>
<BODY>
<H2>Exp&eacute;riences de sortie hors du corps</H2>        
<p>
	Un jour j'ai fait un r&ecirc;ve &eacute;trange, c'est du moins ce que je pensais alors. Je flottais comme en apesanteur. Je voulais ouvrir la porte pour sortir mais ma main traversait la poign&eacute;e, comme si j'&eacute;tais fait d'une substance immat&eacute;rielle. Puis je traversai la porte pour sortir. J'avais conscience d'&ecirc;tre dans un &eacute;tat paranormal. Je sentais des vibrations dans ma t&ecirc;te. Ensuite je me rappelle vaguement avoir visit&eacute; un monde &eacute;trange, brumeux et luminescent, en compagnie d'un guide qui me conduisait le long d'un chemin.<br>
<br>
	Plusieurs ann&eacute;es plus tard, une amie me conseilla de lire le livre de Meurois-Givaudan "R&eacute;cits d'un voyageur de l'Astral". J'&eacute;tais un peu sceptique sur l'existence du monde astral, mais je m'int&eacute;ressais quand m&ecirc;me &agrave; ce sujet. J'ai assist&eacute; &agrave; plusieurs conf&eacute;rences o&ugrave; il &eacute;tait question de voyage astral, j'ai lu des livres sur ce sujet, et j'ai constat&eacute; une grande concordance entre les t&eacute;moignages. J'ai alors commenc&eacute; &agrave; prendre ce sujet au s&eacute;rieux. J'ai &eacute;tudi&eacute; des livres sur les techniques de voyage astral, notamment l'ouvrage de synth&egrave;se de Laura Tuan et un livre d&eacute;crivant une technique bas&eacute;e sur la stimulation des chakras et la visualisation. C'est alors que j'ai r&eacute;alis&eacute; que mon r&ecirc;ve correspondait &agrave; la description des sorties hors du corps. Je m'y int&eacute;ressais depuis longtemps, mais je pensais que'il &eacute;tait n&eacute;cessaire de pratiquer un entrainement long et difficile. J'ai compris qu'en fait la sortie hors du corps &eacute;tait beaucoup plus accessible que je ne le pensais. Je voulais renouveler ce genre d'exp&eacute;riences.<br>
<br>
	Il m'est arriv&eacute; plusieurs fois de vivre certaines exp&eacute;riences similaires, mais sans parvenir jusqu'&agrave; la sortie compl&egrave;te. Vers la fin d'une longue nuit de sommeil, alors que je r&ecirc;vais, je me retrouvais dans un &eacute;tat que j'appellerais la "porte astrale" : je sentais une sorte d'&eacute;motion qui montait en moi et je r&eacute;alisais que j'&eacute;tais en train de r&ecirc;ver. (Je me "r&eacute;veillais dans mon r&ecirc;ve", tout en continuant de r&ecirc;ver.) Souvent, je ressentais alors un sentiment de puissance. Je ressentais aussi une vibration dans la t&ecirc;te, parfois l&eacute;g&egrave;re, parfois tr&egrave;s forte. Quelquefois, je r&ecirc;vais que je volais, puis mon vol d&eacute;viait vers la droite et je me laissai emporter par un vaste mouvement en spirale ascendante. Parfois, au lieu que ce soit moi qui volais, c'&eacute;tait un objet de mon r&ecirc;ve qui volait, que je t&eacute;l&eacute;guidais par ma pens&eacute;e. Puis le r&ecirc;ve s'&eacute;vanouissait, me laissant dans un &eacute;tat interm&eacute;diaire, que j'appelle le "palier astral" : l'esprit &eacute;veill&eacute; et le corps endormi, je continuai &agrave; ressentir les vibrations.<br>
<br>
	Je ne parvenais pas &agrave; franchir ce palier. C'est alors que j'ai lu dans le livre de Muldoon et Carrington "La projection du corps astral" la description d'une sortie hors du corps o&ugrave; le sujet se retrouvait dans un &eacute;tat similaire, ayant l'impression "d'exister quelque part" puis se sentit soulev&eacute; et se retrouva hors de son corps. Je compris alors que cet &eacute;tat ne signifiait pas l'&eacute;chec de l'exp&eacute;rience comme je le craignais d'abord mais au contraire &eacute;tait une &eacute;tape vers la sortie.<br>
<br>
	La fois suivante o&ugrave; cette situation s'est reproduite, le 6 juin 1991 en fin de matin&eacute;e, je r&ecirc;vais que je me trouvais dans une chambre d'h&ograve;tel, allong&eacute; sur un lit ressemblant &agrave; une table d'op&eacute;ration. Je r&eacute;alisai que j'&eacute;tais en train de r&ecirc;ver. Je me retrouvais alors dans cet &eacute;tat de "palier astral". Je pensais &agrave; m'&eacute;lever. Je me suis d'abord senti soulev&eacute; en l'air, puis redescendre. Je pensais &agrave; nouveau &agrave; monter, mais je sentais une r&eacute;sistance, comme si quelque chose me retenait par la nuque. De plus, je perdais le sens du haut et du bas, et je ne savais plus si je montais verticalement ou si je sortais par la t&ecirc;te. Etant bloqu&eacute; au niveau de la t&ecirc;te, j'eus alors l'id&eacute;e de faire sortir d'abord les pieds en les envoyant en l'air afin de changer ma position tout en gardant ma t&ecirc;te astrale pr&egrave;s de la t&ecirc;te physique. J'eus alors la nette sensation que mes pieds partaient en l'air. Supposant qu'ils retomberaient, je pensais avoir mon corps astral &agrave; peu pr&egrave;s horizontal &agrave; angle droit avec le corps physique, les t&ecirc;tes coincidant approximativement. Je me demandais toujours si cela &eacute;tait bien r&eacute;el, car je ne voyais rien. J'ouvris alors les yeux.<br>
 <br>
	Ce que je vis m'&eacute;tonna et me d&eacute;routa compl&egrave;tement. J'avais l'impression de recevoir la sensation visuelle &agrave; l'&eacute;tat brut, sans le "filtre" interpr&eacute;teur du cerveau, et je dus faire un effort pour interpr&eacute;ter ce que je voyais. C'&eacute;tait rouge&acirc;tre et blanc, de la couleur du canap&eacute; sur lequel je dormais, mais avec une brillance, une puret&eacute; et un &eacute;clat des couleurs en comparaison desquels la vision normale parait terne. Je reconnus assez facilement les motifs de mon canap&eacute;. C'&eacute;tait donc mon canap&eacute; que je voyais. Mais sous quel angle bizarre ? Je dus faire un effort de concentration mentale pour interpr&eacute;ter la vision brute. Je voyais une ligne oblique d&eacute;limitant mon canap&eacute;. Le canap&eacute; se trouvait AU DESSUS de cette ligne. Est-ce que je voyais le bas du canap&eacute; ou est-ce qu'il &eacute;tait &agrave; l'envers ? <br>
	Je voulais aussi voir mon corps physique de l'ext&eacute;rieur. Je parvins finalement &agrave; redresser ma position et &agrave; me placer en face de mon corps physique, j'avais l'impression qu'une sorte de voile pendait devant moi et m'emp&ecirc;chait de bien voir. Finalement, en ayant assez vu pour cette fois, je me laissai glisser vers mon corps physique pour le r&eacute;int&eacute;grer. Je me retrouvai alors dans l'&eacute;tat de veille normal. <br>
	C'est seulement apr&egrave;s que j'ai compris ce qui s'&eacute;tait pass&eacute;. Ca correspondait avec ce que j'avais lu. Quand j'ai commenc&eacute; &agrave; monter, j'ai &eacute;t&eacute; retenu par le cordon astral. Ensuite j'ai envoy&eacute; mes pieds astraux en l'air mais, comme le corps astral a une densit&eacute; voisine de celle de l'air, ils ne sont pas retomb&eacute;s, et je suis rest&eacute; dans cette position, le corps astral &agrave; l'envers et l&eacute;g&egrave;rement inclin&eacute;, ce qui explique que je voyais mon canap&eacute; &agrave; l'envers. Le voile qui m'emp&ecirc;chait de bien voir &eacute;tait probablement le cordon astral.<br>
<br>
	Par la suite, j'ai eu d'autres exp&eacute;riences similaires. Une fois, au lieu de vouloir monter, je suis sorti de mon corps en me levant normalement.<br>
	Diff&eacute;rnts auteurs affirment qu'il y a une diff&eacute;rence entre sortie &agrave; proximit&eacute; du corps (2 &agrave; 3 m&egrave;tres environ) et sortie &eacute;loign&eacute;e. Certains font une diff&eacute;rence entre plusieurs corps emboit&eacute;s (&eacute;th&eacute;rique, astral, mental...), d'autres parlent de champ d'activit&eacute; du c&acirc;ble astral... Personnellement, j'ai eu quelques exp&eacute;riences qui semblent &ecirc;tre des sorties &agrave; plus grande distance, avec une mobilit&eacute; plus facile mais une perception de la r&eacute;alit&eacute; plus floue, onirique, o&ugrave; les images de r&ecirc;ve semblaient se m&ecirc;ler parfois &agrave; celles de la r&eacute;alit&eacute;, contrairement &agrave; la sortie d&eacute;crite pr&eacute;c&eacute;demment o&ugrave; la perception semblait m&ecirc;me plus r&eacute;elle que la r&eacute;alit&eacute; mais les d&eacute;placements &eacute;taient plus difficiles, entrav&eacute;s par le cordon astral. Au cours de sorties &agrave; plus longue distance, il m'est cependant arriv&eacute; de voir des d&eacute;tails pr&eacute;cis, ce qui m'incite &agrave; penser qu'il y a une part de vrai.<br>
<br>
	Une fois par exemple j'ai mis en haut de mon armoire des cartes de Jaro et lors d'une sortie hors du corps j'ai d'abord vu la carte repr&eacute;sentant deux personnages c&ograve;te &agrave; c&ograve;te pis en observant plus attentivement j'ai vu que l'un d'eux portait un v&ecirc;tement avec des petits ovales clairs sur fond gris fonc&eacute;. De retour dans mon corps je regarde la carte. Il n'y avait pas les deux personnages mais il y avait bien des petits ovales clairs sur fond gris fonc&eacute;. Il semblerait donc qu'il s'agissait bien d'une sortie hors du corps mais o&ugrave; la perception est plus floue, o&ugrave; le r&ecirc;ve se m&ecirc;le &agrave; la r&eacute;alit&eacute;. En g&eacute;n&eacute;ral il semblerait que j'identifie plus facilement les motifs r&eacute;p&eacute;titifs comme ceux de mon canap&eacute;, les petits ovales, ou encore les ast&eacute;risques dispos&eacute;es en quinconce sur le fond d'une boite de fromage.<br>
<br>
	Il m'est arriv&eacute; aussi de sortir &agrave; quelques centim&egrave;tres de mon corps physique et en ouvrant les yeux je voyais avec ma vision astrale (ou &eacute;th&eacute;rique ?) caract&eacute;ristique par la brillance des couleurs. J'ai vu des choses tellement bizarres que je n'oserais pas affirmer que c'&eacute;tait r&eacute;el et non le fruit de mon imagination ou des images de r&ecirc;ve. Mais certains auteurs affirment que le monde astral est un monde o&ugrave; nos pens&eacute;es, nos d&eacute;sirs et nos craintes se mat&eacute;rialisent.<br>
	Une fois j'ai pris l'encadrement de ma porte pour un miroir dans lequel j'ai vu une forme humaine que j'ai pris pour mon reflet. Je lui ai fait signe de la main mais il ne m'a pas r&eacute;pondu. Je l'ai alors observ&eacute; plus attentivement et j'ai vu son visage se transformer comme Dr Jekyll et Mr Hyde... Il me regardait avec sa t&ecirc;te hideuse et son regard m&eacute;chant. Je r&eacute;alisai alors que je me sentais soulev&eacute; par une force EXTERIEURE &agrave; moi! Je commencai &agrave; avoir peur... Il faut que je retourne dans mon corps et que je me r&eacute;veille! Je dus faire un effort pour cela. je r&eacute;citai une petite pri&egrave;re, je r&eacute;ussis &agrave; joindre mes mains (un bon truc pour rester dans son corps physique) puis je me r&eacute;veillais. J'&eacute;tais perplexe : r&ecirc;ve ou r&eacute;alit&eacute; ? Ce pourrait &ecirc;tre quelques gn&ograve;mes (esprits &eacute;l&eacute;mentals de la terre) auxquels j'ai eu affaire...<br>
	Une autre fois j'ai vu, toujours avec cette vision brillante, une sorte de petit reptile qui ressemblait &agrave; un gros l&eacute;zard (une Salamandre, esprit &eacute;l&eacute;mental du feu ?) qui grimpait sur une planche. Elle semblait par moment se transformer en tortue puis en homuncule... Je pensais que &ccedil;a devait &ecirc;tre une image de r&ecirc;ve et que je devais chasser cette vision de mon esprit pour voir la r&eacute;alit&eacute; telle qu'elle est; je me demandais "Qu'est-ce que je vois ?" mais je voyais toujours la salamandre. De retour dans mon corps, elle disparut totalement.<br>
<br>
	J'ai fait une exp&eacute;rience pour mesurer l'action physique du corps astral avec un d&eacute;tecteur &eacute;lectronique de ph&eacute;nom&egrave;nes &eacute;l&eacute;ctromagn&eacute;tiques comprenant un d&eacute;tecteur de lumi&egrave;re, un d&eacute;tecteur de perturbations du champ magn&eacute;tique, et un d&eacute;tecteur de champ &eacute;lectrostatique. Ce dernier a donn&eacute; des r&eacute;sultats.<br>
	Le principe est le suivant : l'antenne de d&eacute;tection constitu&eacute;e d'un simple fil est reli&eacute;e &agrave; 4 ou 5 &eacute;tages d'amplification &agrave; transistors, &eacute;metteur commun, antenne reli&eacute;e &agrave; la base, sans r&eacute;sistance, l'&eacute;metteur et le collecteur en d&eacute;rivation d'une des r&eacute;sistances d'un multivibrateur astable constitu&eacute; de deux &eacute;tages amplificateurs en boucle comprenant 2 transistors, 2 condensateurs et 4 r&eacute;sistances, et dont la sortie oscillante est reli&eacute;e &agrave; un magn&eacute;tophone tournant au ralenti.<br>
	Apr&egrave;s avoir mis l'appareil en marche, je me suis endormi avec l'appareil &agrave; cot&eacute;. J'ai dormi quelque temps puis je me suis senti soulev&eacute; de quelques centim&egrave;tres. Je retourne dans mon corps physique et je me r&eacute;veille, j'arr&ecirc;te le magn&eacute;tophone, je rembobine un peu et j'&eacute;coute. A un certain moment j'entends nettement une modification du son. Je me dis alors que si le son s'arr&ecirc;te bient&ograve;t, &ccedil;a a march&eacute;. Le son s'arr&ecirc;te effectivement apr&egrave;s quelques instants correspondant au temps n&eacute;cessaire pour rentrer dans mon corps, me r&eacute;veiller et arr&ecirc;ter le magn&eacute;tophone. Cett exp&eacute;rience semble indiquer que le corps astral est d&eacute;tectable par son champ &eacute;lectrique.<br>
	J'ai ensuite lu qu'une exp&eacute;rience similaire avait &eacute;t&eacute; r&eacute;alis&eacute;e avec succ&egrave;s dans une universit&eacute; am&eacute;ricaine avec un d&eacute;tecteur de pr&eacute;sence plus sophistiqu&eacute; et des conditions exp&eacute;rimentales plus strictes. <br>
	Cet effet pourrait avoir des applications int&eacute;ressantes dans le domaine de la communication et du spiritisme. On pourrait par exemple utiliser ce proc&eacute;d&eacute; pour &eacute;changer des messages avec un code comme le Morse. <br>
<br>
	Ensuite il y a eu une longue p&eacute;riode (plusieurs semaines) pendant laquelle je n'ai eu presque aucune exp&eacute;rience.<br>
	Puis je suis sorti de mon corps, toujours apr&egrave;s une nuit de sommeil. Les conditions &eacute;taient les suivantes : la veille, j'ai pass&eacute; une matin&eacute;e tranquille, je suis all&eacute; au march&eacute; vers 13 heures, j'ai pris un bon d&eacute;jeuner avec beaucoup de crudit&eacute;s, je suis all&eacute; &agrave; la plage l'apr&egrave;s-midi, au retour j'ai fait des exercices de respiration puis un travail intellectuel jusqu'au soir. J'ai mang&eacute; un casse-croute, j'ai fait une petite promenade. J'ai mang&eacute; un diner l&eacute;ger, j'ai &eacute;cout&eacute; de la musique de 21 heures &agrave; 22 heures 30. Je me sentais tr&egrave;s stress&eacute; et nerveux. J'ai pris 1/2 comprim&eacute; de Ph&eacute;nergan avant de dormir. Je ne voulais pas sortir de mon corps cette nuit. Je me suis r&eacute;veill&eacute; vers 5 heures. Je me suis rendormi. Un peu plus tard j'ai senti les vibrations et je suis sorti &agrave; quelques centim&egrave;tres au-dessus de mon corps.<br>
	J'ai eu l'impression que le probl&egrave;me est plus physiologique que psychologique et que le Ph&eacute;nergan induit l'&eacute;tat ad&eacute;quat.<br>
	Plus tard je r&ecirc;vais lucidement et sentais les vibrations. Je me sentais emp&eacute;tr&eacute; et fis un effort pour me lever comme dans le corps physique, mais le r&eacute;sultat fut que je me suis lev&eacute; physiquement.<br>
<br>
<br>
	<H3>Nouvelles exp&eacute;riences (d&eacute;but Novembre 1991)</H3><br>
<br>
	 J'ai fait une petite sortie avec vision astrale mais sans &eacute;loignement.<br>
	Quelques jours plus tard, je me retrouve dans l'&eacute;tat de vibration (vers le 5). Je commence par voloir sortir, mais je me sens emp&eacute;tr&eacute;. Je me souviens alors de la technique de Robert Monroe d&eacute;crite dans "Le voyage hors du corps" que je venais de relire. Monroe conseille de commencer par apprendre &agrave; contr&ograve;ler les vibrations avant de sortir. On peut, par la pens&eacute;e, les faire descendre vers les pieds, puis remonter dans la t&ecirc;te, puis les faire augmenter d'intensit&eacute; et de fr&eacute;quence. Repensant &agrave; &ccedil;a, je porte mon attention sur les vibrations encore l&eacute;g&egrave;res dans ma t&ecirc;te, puis je les fais descendre dans l'abdomen puis remonter dans la t&ecirc;te, puis je les fais augmenter. Elles deviennent plus fortes et plusrapides, comme un moteur qui acc&eacute;l&egrave;re au d&eacute;marrage. J'entends alors un bruit tr&egrave;s fort, comme si un gros moteur vrombissait dans ma t&ecirc;te avec un grand fracas m&eacute;tallique. Ensuite, en augmentant encore de fr&eacute;quence, les vibrations deviennent moins fortes. Il me semble alors entendre des voix, des bribes de phrases. Hallucination auditive ou entit&eacute;s ? Selon Monroe c'est ce niveau vibratoire &eacute;lev&eacute; en fr&eacute;quence qui permet le d&eacute;tachement. Je me sens en effet dans un &eacute;tat comparable &agrave; celui de mes sorties avec s&eacute;paration en Juin-Juillet dernier, o&ugrave; j'ai ressenti aussi des vibrations extr&ecirc;mement fortes, alors que par la suite elles sont devenues moins fortes, car je m'&eacute;veillais plus vite quand les vibrations commen&ccedil;aient. Je sentais cette fois que j'aurais pu sortir de mon corps mais j'ai pr&eacute;f&eacute;r&eacute; arr&ecirc;tet l'exp&eacute;rience.<br>
<br>
	Plus tard (en Novembre) je sens &agrave; nouveau les vibrations et j'effectue une sortie partielle des bras que je vois sous un aspect fant&ograve;matique. En tenant ensemble mes mains astrales, je ressens la m&ecirc;me sensation que j'aurais ressentie avec mes mains physiques. Mais en voulant allonger mon bras, je ressens une curieuse sensation, une sorte de frottement dans la masse de ma main, un m&eacute;lange d'&eacute;tirement et de d&eacute;chirement non douloureux.<br>
<br>
	Plus tard, en r&ecirc;vant je sens une sorte de malaise, je me sens soulev&eacute; hors de mon corps (par des entit&eacute;s ?). Je n'arrive pas &agrave; rentrer, comme si j'&eacute;tais "de travers", je sors et je vois une grande pi&egrave;ce spatieuse, sombre avec un brouillard blanch&acirc;tre, un sol d&eacute;gag&eacute; avec un petit tas d'objets au milieu. Rien ne semble correspondre &agrave; &ccedil;a chez moi.<br>
<br>
	Une nuit, je r&ecirc;ve que je suis au bord de la mer, et je vois un avion dans le ciel. Il semble fr&ograve;ler la colline au-dessous de lui. Puis il d&eacute;crit une boucle et vient se poser devant moi au bord de l'eau. Il mesure quelques dizaines de centim&egrave;tres. Ca me rappelle d'autres r&ecirc;ves que j'ai fait o&ugrave; des avions se sont pos&eacute;s devant moi et sont devenus tout petits. Cette r&eacute;flexion m'am&egrave;ne &agrave; m'interroger sur la r&eacute;alit&eacute; de ce que je viens de voir, et je r&eacute;alise alors que je suis en train de r&ecirc;ver.<br>
	Je m'&eacute;lance vers la mer et je m'envole en rasant les flots. Je me dirige vers une &icirc;le. Sur cette &icirc;le je vois une sorte de boite rectangulaire blanche. Qu'est-ce que &ccedil;a fait l&agrave;? C'est curieux, je n'avais pas command&eacute; cette boite... Pensant &agrave; l'exp&eacute;rience d'Ouspenski, je laisse la boite et continue &agrave; survoler l'&icirc;le en rasant le sol, qui monte de plus en plus. Arriv&eacute; au sommet, je m'&eacute;lance dans le ciel. Je tourne &agrave; droite puis je vole en reculant. Je ressens une vibration dans la t&ecirc;te, ainsi qu'une sorte d'ivresse due au fait de voler.<br>
	A ce moment le r&ecirc;ve se dissipe. JE d&eacute;cide alors de profiter de cette occasion favorable pour tenter une sortie hors du corps.<br>
	Je me sens effectuer un mouvement tournant vers la droite tout en montant et en me d&eacute;pla&ccedil;ant vers l'ouest (ma t&ecirc;te est situ&eacute;e &agrave; l'ouest). Je me sens ensuite monter vers le haut d'un meuble o&ugrave; j'avais dispos&eacute; sans regarder quelques petits objets, pour v&eacute;rifier la r&eacute;alit&eacute; de mes exp&eacute;riences. Je regarde leur disposition puis, satisfait de l'exp&eacute;rience, je redescends.<br>
	J'entrouvre les yeux et j'aper&ccedil;ois sur la droite une surface rectangulaire d'une couleur tr&egrave;s particuli&egrave;re, entre le rose et le dor&eacute;, avec ce qui me semble &ecirc;tre un trou de serrure. Je pense alors qu'il doit s'agir d'une petite porte dans un meuble. Mais je n'arrive pas &agrave; bouger, j'ai l'impression de ne pas &ecirc;tre bien rentr&eacute; dans mon corps. Je me d&eacute;tends quelques instants avant de me r&eacute;veiller compl&egrave;tement. <br>
	Je regarde les objets dispos&eacute;s en haut du meuble : leur disposition ne correspond pas &agrave; celle que j'avais vue. Le probl&egrave;me des sorties hors du corps est que cet &eacute;tat favorise les hallucinations et que l'on a tendance &agrave; voir ce qu'on imagine, un peu comme dans les r&ecirc;ves lucides, et il n'est pas toujours facile de faire la diff&eacute;rence entre  images de r&ecirc;ve et perceptions r&eacute;elles.<br>
	Puis je r&eacute;alise que je n'ai pas de meuble avec une petite porte rose-dor&eacute; au sud de mon lit. Je me demande qu'est-ce que j'ai bien pu apercevoir. Je cherche quelque chose qui pourrait ressembler &agrave; ce que j'ai vu, et je vois un petit livre dont je remarque que la couleur correspond exactement &agrave; celle que j'ai vue. Il s'agit d'un livre de th&eacute;osophie, "La sagesse antique" d'Annie Besant. Au milieu de la couverture il y a le symbole de la croix ans&eacute;e &eacute;gyptienne, qui peut faire penser &agrave; un trou de serrure. Ce livre se trouve dans un tiroir ouvert, situ&eacute; plus haut que mon lit, &agrave; l'ouest. Je ne pouvais pas le voir depuis la position occup&eacute;e par mon corps physique allong&eacute; sur mon lit. Par contre, en supposant que mon corps astral ait r&eacute;ellement effectu&eacute; le mouvement que j'ai ressenti (rotation &agrave; droite, mouvement vers le haut et vers l'ouest) il aurait &eacute;t&eacute; plac&eacute; au bon endroit pour voir ce livre sur la droite. Bien s&ucirc;r je connaissais l'existence de ce livre, mais je pense qu'il est peu probable qu'il s'agisse d'une hallucination car quand je l'ai vu je ne pensais pas qu'il s'agissait de ce livre, je pensais que c'&eacute;tait une petite porte. G&eacute;n&eacute;ralement les hallucinations correspondent &agrave; ce qu'on s'attend &agrave; voir ou qu'on imagine, ce qui n'&eacute;tait pas le cas ici. Ca me parait peu cr&eacute;dible que mon subconscient ait pu faire &agrave; mon insu le raisonnement selon lequel si en partant de mon lit j'effectue tel mouvement pr&eacute;cis je me retrouve &agrave; tel endroit d'o&ugrave; je devrais voir ce livre.<br>
<br>
<br>
<br>
	<H3>D&eacute;roulement d'une projection</H3><br>
<br>
	Ca commence par un r&ecirc;ve dans lequel je me rends compte que je r&ecirc;ve (r&ecirc;ve lucide). Cela pourrait &ecirc;tre d&ucirc; &agrave; l'apparition d'un d&eacute;tail absurde dans le r&ecirc;ve, mais &eacute;tant donn&eacute; qu'il m'arrive souvent de faire des r&ecirc;ves absurdes sans rien remarquer et que d'autre part il m'arrive aussi de me rendre compte que je r&ecirc;ve sans qu'il y ait d'absurdit&eacute; &eacute;norme, l'explication qui me parait la plus probable est qu'&agrave; l'origine survient un &eacute;tat physiologique et/ou de conscience que l'on pourrait qualifier d'"&eacute;veil dans le r&ecirc;ve" au cours duquel le niveau de vigilance, habituellement bas pendant le r&ecirc;ve, augmente alors que le r&ecirc;ve continue. A partir de ce moment, on ne peut que remarquer la premi&egrave;re anomalie dont la plupart des r&ecirc;ves sont remplis. Cet &eacute;tat de conscience particulier est g&eacute;n&eacute;ralement accompagn&eacute; d'une sorte d'&eacute;motion qui peut ressembler &agrave; un sentiment de puissance, quelquefois &agrave; la peur. J'appelle cette phase la "porte astrale".<br>
	A ce moment on commence &agrave; ressentir une vibration dans la t&ecirc;te. Souvent on r&ecirc;ve qu'on vole. Parfois au lieu que ce soit moi qui vole, c'est un autre objet de mon r&ecirc;ve qui semble comme t&eacute;l&eacute;guid&eacute; par ma pens&eacute;e. Ensuite on se retrouve dans l'&eacute;tat que j'appelle "palier astral", on continue &agrave; ressentir les vibrations, l'esprit est &eacute;veill&eacute; mais le corps reste endormi    , on a la "sensation d'exister quelque part" (Muldon - Carrington). A ce moment, si le niveau vibratoire est insuffisant, on peut l'augmenter en utilisant la technique de Robert Monroe. Quand le niveau vibratoire (fr&eacute;quence) est suffisant, on peut sortir, sinon on est emp&eacute;tr&eacute;, mais on peut quand m&ecirc;me effectuer une sortie partielle ou faire sortir un corps plus subtil.<br>
<br>
<br>
	<H3>Hypoth&egrave;se d'explication</H3><br>
<br>
	L'univers est constitu&eacute; de quelque chose dont la nature exacte reste &agrave; d&eacute;terminer (une sorte d'&eacute;ther, ou d'espace-temps ?), et qui vibre &agrave; une certaine fr&eacute;quence. Cette fr&eacute;quence vibratoire correspond &agrave; une sorte de quatri&egrave;me dimension de l'espace (ou une cinqui&egrave;me dimension de l'espace-temps). Le corps astral est constitu&eacute; d'une mati&egrave;re subtile dont la nature exacte reste aussi &agrave; d&eacute;terminer, et qui normalement se trouve dans le corps physique au m&ecirc;me niveau vibratoire et se trouve donc emprisonn&eacute; dans ce corps. Mais le corps astral peut &eacute;lever son niveau vibratoire, ce qui lui permet de quitter le corps physique. Quand la fr&eacute;quence vibratoire du corps astral augmente, la diff&eacute;rence avec la fr&eacute;quence du corps physique produit des battements, ce qui explique les vibrations, le "moteur dans la t&ecirc;te". Quand la fr&eacute;quence vibratoire du corps astral est suffisante, il peut sortir compl&egrave;tement, sinon il ne peut sortir que partiellement, et des frottement faisant intervenir la quatri&egrave;me dimension, la fr&eacute;quence vibratoire, peuvent se produire, donnant l'impression de "frottements dans la masse". <br>
	Une fr&eacute;quence vibratoire F peut provoquer une r&eacute;sonance sur un objet de fr&eacute;quence propre N x F, et non r&eacute;ciproquement. Par exemple si on pousse une balan&ccedil;oire une fois sur N &ccedil;a marche, mais pas si on la pousse N fois r&eacute;guli&egrave;rement espac&eacute;es sur un balancement. Cela expliquerait que les objets physiques soient per&ccedil;us par la visin astrale, mais les entit&eacute;s astrales sont invisibles &agrave; la vision physique normale. Le "plan" (ou niveau vibratoire) astral pourrait correspondre &agrave; une fr&eacute;quence multiple du "plan" (ou niveau vibratoire) physique.<br>
<br>
<br>
	<H3>Techniques de sortie hors du corps</H3><br>
<br>
	Il faut tout d'abord provoquer l'apparition de la "porte astrale". On peut favoriser cet &eacute;tat, qui apparait g&eacute;n&eacute;ralement apr&egrave;s une longue nuit de sommeil, d&egrave;s la journ&eacute;e pr&eacute;c&eacute;dente en mangeant bien mais pas trop &agrave; midi, en prenant un diner l&eacute;ger, en ayant des activit&eacute;s physiques et intellectuelles pas trop stressantes, en &eacute;vitant trop de rencontres, en faisant quelques exercices de yoga 'respiration, vide mental, visualisation, concentration, m&eacute;ditation...). Il semblerait &eacute;galement que le Ph&eacute;nergan (prom&eacute;thazine) pris avant de dormir (1/5 &agrave; 1/2 comprim&eacute;) favorise l'apparition de la "porte astrale" et de l'&eacute;tat de vibration. Cela a &eacute;t&eacute; confirm&eacute; par le Dr Lef&eacute;bure dans "Exp&eacute;riences initiatiques". D'une fa&ccedil;on g&eacute;n&eacute;rale toutes les substances qui ont un effet hypnotique (ether, chloroforme, Valium...) semblent &eacute;galement favoriser les sorties hors du corps.<br>
	Choisir une nuit o&ugrave; on peut dormir aussi tard qu'on veut et se forcer &agrave; dormir longtemps m&ecirc;me si l'on n'a plus sommeil, favorise l'&eacute;veil dans le r&ecirc;ve. La porte astrale a alors toutes les chances de se produire. Elle se manifeste par une sorte d'&eacute;veil au milieu du r&ecirc;ve. On se rend compte qu'on est en train de r&ecirc;ver (r&ecirc;ve lucide). On sent alors une sorte de sentiment de puissance monter en soi. On est dans son propre monde dont on est en quelque sorte le dieu. Tout devient possible, par exemple voler, ce qui arrive souvent, probablement en association avec le v&eacute;ritable envol du corps astral. On se sent alors emport&eacute; dans un vaste mouvement tournant vers la droite, une spirale ascendante. On se laisse emporter par ce mouvement. Pendant ce temps, les vibrations deviennent de plus en plus fortes. On peut m&ecirc;me avoir l'impression d'avoir un gros moteur qui vrombit dans la t&ecirc;te. Le r&ecirc;ve se dissipe alors, et on se retrouve alors dans l'&eacute;tat de palier astral, l'esprit &eacute;veill&eacute;, le corps endormi et les vibrations dans la t&ecirc;te. Si on est rest&eacute; assez longtemps dans le r&ecirc;ve, les vibrations peuvent avoir atteint une fr&eacute;quence suffisante pour la sortie. On le sait si on a entendu un vrombissement tr&egrave;s fort, avec un grand fracas m&eacute;tallique, comme un gros moteur dans la t&ecirc;te. Sinon on peut augmenter cette fr&eacute;quence par la pens&eacute;e. On peut aussi l'augmenter en voulant sortir de son corps. On peut aussi la faire se d&eacute;placer vers les pieds puis revenir dans la t&ecirc;te. Une technique qui a bien march&eacute; une fois consiste &agrave; d'abord vouloir sortir en tirant un peu car on se sent emp&eacute;tr&eacute;, puis faire descendre les vibrations dans le ventre et revenir dans la t&ecirc;te, puis (toujours par la pens&eacute;e) les faire augmenter de fr&eacute;quence, jusqu'au vrombissement, ensuite toujours en augmentant de fr&eacute;quence elles diminuent d'intensit&eacute;. On peut alors sortir de son corps. <br>
	Pour cela il y a plusieurs techniques. On peut vouloir monter, ou se lever normalement, ou tourner sur soi-m&ecirc;me, ou encore pousser avec le cordon astral qui relie le corps astral au corps physique au niveau de la nuque. Quand on se sent en dehors de son corps physique, ouvrir les yeux ou vouloir voir.<br>
	Le retour est tr&egrave;s facile. Il suffit de se laisser glisser doucement vers son corps physique.<br>
	Si on n'arrive pas &agrave; atteindre un niveau vibratoire suffisant on peut quand m&ecirc;me effectuer une sortie partielle. On peut voir avec la vision astrale. On peut sortir les bras et les regarder. On peut aussi faire sortir un corps plus subtil (mental ?). La libert&eacute; de mouvement est meilleure mais la vision est moins bonne, des hallucinations au niveau de l'image globale se m&eacute;langent &agrave; une perception r&eacute;elle de d&eacute;tails.<br>
<br>
	Un autre probl&egrave;me est que contrairement &agrave; ce qui se passe d'habitude, avec la sortie hors du corps une technique qui a march&eacute; une fois ne semble plus marcher aussi bien par la suite. Une explication possible est que la premi&egrave;re fois on ne sait pas si &ccedil;a va marcher, donc on est plus motiv&eacute;, d'une part par la curiosit&eacute;, d'autre part parce qu'on a moins peur. Les fois suivantes il arrive souvent que la r&eacute;utilisation d'une technique d&eacute;ja utilis&eacute;e ne marche plus ou a pour effet que l'on sort de son corps. Pour r&eacute;soudre ce probl&egrave;me, il faut inventer sans cesse de nouvelles techniques ou bien apprendre &agrave; maitriser sa peur et augmenter sa motivation. <br>
<br>
<br>
<br>

</BODY></HTML>
