<HTML><HEAD><TITLE>Le robot math&eacute;maticien</TITLE></HEAD>
<BODY>
<H2>Le robot math&eacute;maticien</H2>
<p>
	Dans "Les Ombres de l'Esprit", chapitre 3.16 page 154, Roger Penrose propose une d&eacute;monstration du fait qu'un robot math&eacute;maticien ne peut fonctionner selon un m&eacute;canisme algorithmique. Il explique qu'il n'y pas besoin que le robot soit convaincu de connaitre son v&eacute;ritable m&eacute;canisme pour qu'une contradiction aparaisse. Mais son raisonnement me semble comporter certaines impr&eacute;cisions.<br>
<br>
	Tout d'abord, Penrose passe sous silence un fait important :<br>
	Si le robot fait l'hypoth&egrave;se m selon laquelle il est r&eacute;gi par l'ensemble de m&eacute;canismes M et qu'il veut tirer des cons&eacute;quences de cette hypoth&egrave;se, alors il devient logiquement ill&eacute;gitime pour lui de continuer &agrave; raisonner normalement : s'il veut tenir compte de toutes les cons&eacute;quences de l'hypoth&egrave;se m, il doit aussi tenir compte du fait que sous cette hypoth&egrave;se, il ferait ses d&eacute;ductions selon les r&egrave;gles d&eacute;coulant de M, et non pas selon celles d&eacute;coulant de ses m&eacute;canismes r&eacute;els qui, ne l'oublions pas, de son point de vue sont des m&eacute;canismes M' &agrave; priori diff&eacute;rents de M, m&ecirc;me si son constructeur sait qu'en fait M = M'. De son point de vue, il ne peut plus l&eacute;gitimement utiliser directement M' pour raisonner, mais il ne peut utiliser M' que comme "interpr&eacute;teur" de M.  <br>
Cependant, si on se place du point de vue du constructeur, cela ne change rien car cela revient au m&ecirc;me d'ex&eacute;cuter directement M (qui est &eacute;gal &agrave; M') ou d'interpr&eacute;ter M avec M (a part que c'est plus lent). Mais il me semble quand m&ecirc;me important de mentionner ce probl&egrave;me.<br>
<br>
	Voyons comment le probl&egrave;me se pr&eacute;sente de ce point de vue.<br>
<br>
	Les assertions *m sont celles que le robot peut d&eacute;duire en interpr&eacute;tant M avec M' (qui, nous le savons, est &eacute;gal &agrave; M), c'est &agrave; dire celles qu'il peut d&eacute;duire directement avec M, autrement dit les assertions *m ne sont ni plus ni moins que les assertions * !<br>
<br>
	O&ugrave; est l'erreur ?<br>
<br>
	En fait, pour que le robot puisse attribuer l'imprimatur *m &agrave; l'assertion G(Qm(M)), il ne suffit pas de faire l'hypoth&egrave;se m : "Les m&eacute;canismes M sous-tendent la compr&eacute;hension math&eacute;matique du robot.". Il faudrait faire l'hypoth&egrave;se plus forte n: "m et le robot sait que m".<br>
<br>
	Le raisonnement de Penrose ne prouve donc pas que le robot ne peut fonctionner suivant des m&eacute;canismes algorithmiques, mais seulement que s'il fonctionne selon des m&eacute;canismes algorithmiques alors il ne peut pas connaitre compl&egrave;tement ses propres m&eacute;canismes.<br>
<br>
	Examinons maintenant ce qui pourrait se passer concr&eacute;tement si on communiquait au robot ses m&eacute;canismes M et qu'on r&eacute;ussisait &agrave; le convaincre du fait que ce sont bien ses propres m&eacute;canismes.<br>
<br>
	Cette nouvelle conviction modifierait les m&eacute;canismes en question, qui deviendraient une version am&eacute;lior&eacute;e de M que nous appelerons M+.<br>
<br>
	Voyons en quoi consiste exactement M+.<br>
<br>
	Dans un premier temps, avec ses m&eacute;canismes M et la connaissance du fait que ses m&eacute;canismes sont M, le robot peut faire des d&eacute;ductions plus puissantes g&eacute;n&eacute;r&eacute;es par des m&eacute;canismes que nous appellerons M1.<br>
	Mais le robot sachant que ses nouveaux m&eacute;canismes incluent M1, ajouterait cette connaissance &agrave; ses propres m&eacute;canismes qui deviendrait M2. et ainsi de suite. Supposons que ses m&eacute;canismes d'origine M lui permettent d'acc&eacute;der &agrave; tous les ordinaux transfinis inf&eacute;rieurs &agrave; x0. Il pourrait d&eacute;duire de la connaissance de M le fait que x0 est un ordinal transfini et ainsi passer directement aux m&eacute;canismes Mx0. et continuer ainsi de suite &agrave; l'infini. Cependant, ses m&eacute;canismes M+ restant algorithmiques et finis, il n'aura jamais acc&egrave;s qu'aux ordinaux transfinis inf&eacute;rieurs &agrave; un certain ordinal X, ce qui est coh&eacute;rent par rapport au fait que M+ reste un ensemble de m&eacute;canismes algorithmique fini et donc n&eacute;cessairement limit&eacute;.<br>
<br>
<br>
<br>
<br>
	<br>

</BODY></HTML>
