<HTML><BODY>
<br>
Je comprends ceux qui veulent interdire le port du foulard islamique au lyc&eacute;e,<br>
mais je ne les approuve pas.<br>
<br>
Je les comprends car je suis conscient du fait qu'il s'agit d'une r&eacute;action naturelle dict&eacute;e par les r&egrave;gles qui d&eacute;terminent l'&eacute;volution de la vie, consistant en une hi&eacute;rarchie de niveaux d'organisation, le groupement d'&eacute;l&eacute;ments de chaque niveau donnant un &eacute;l&eacute;ment du niveau sup&eacute;rieur : ...? -> quarks -> particules -> atomes -? mol&eacute;cules -> cellules -> individus -> soci&eacute;t&eacute;s -> ...? .<br>
Lorsque les cellules s'assemblent en organismes pluricellulaires, elles &eacute;tablissent une s&eacute;paration entre celles qui font partie de l'organisme et les autres. il est n&eacute;cessaire qu'elles disposent d'un moyen de se reconnaitre entre elles et d'identifier les intruses, qui peuvent &ecirc;tre soit int&eacute;gr&eacute;es &agrave; l'organisme par la digestion, soit &eacute;limin&eacute;es. Le corps dispose pour cela d'un m&eacute;canisme de d&eacute;fense immunitaire.<br>
De la m&ecirc;me mani&egrave;re, les individus d'une soci&eacute;t&eacute; se reconnaissent par le fait qu'ils respectent la norme de cette soci&eacute;t&eacute;. Les r&eacute;actions de rejet de ceux qui ne la respectent pas sont des r&eacute;actions de d&eacute;fense immunitaire de la soci&eacute;t&eacute;. Le fait de vouloir int&eacute;grer les personnes issues d'autres soci&eacute;t&eacute;s est comparable &agrave; la digestion.<br>
<br>
Mais je n'approuve pas ces r&eacute;actions, car je pense qu'il est temps maintenant de passer au niveau d'organisation suivant celui de la soci&eacute;t&eacute;, une "m&eacute;ta-soci&eacute;t&eacute;" regroupant des ethnies, des cultures et des religions diff&eacute;rentes, dans le respect de ces diff&eacute;rences qui, si elles sont pleinement accept&eacute;es, ne constituent pas une source de probl&egrave;mes mais au contraire une richesse. Je pense que la solution n'est pas l'int&eacute;gration-uniformisation mais une soci&eacute;t&eacute; pluriethnique, pluriculturelle et plurireligieuse. <br>
Le fait d'imposer une norme dans les lyc&eacute;es revient &agrave; enseigner aux &eacute;l&egrave;ves qu'il est mal d'&ecirc;tre diff&eacute;rent : c'est une &eacute;cole de l'intol&eacute;rance et du racisme, qui fabrique des futurs racistes. Si au contraire on laissait aux &eacute;l&egrave;ves la libert&eacute; de porter les signes ext&eacute;rieurs qui d&eacute;coulent de la pratique d'une religion, de l'appartenance &agrave; une culture ou simplement d'un choix personnel, on apprendrait aux &eacute;l&egrave;ves le respect des diff&eacute;rences. <br>
<br>
Le foulard islamique n'est pas un signe religieux au sens strict, comme la croix ou l'&eacute;toile de David. C'est un signe ext&eacute;rieur impos&eacute; par la pratique d'une religion, dont on peut comprendre les raisons, sans &ecirc;tre oblig&eacute; de les approuver.<br>
Cette obligation se situe dans le cadre des r&egrave;gles concernant la sexualit&eacute; existant dans la plupart des religions, que l'on peut justifier par des consid&eacute;rations d'efficacit&eacute; biologique qui font qu'il est pr&eacute;f&eacute;rable de former des couples stables pour &eacute;viter la propagation des maladies. C'est pourquoi les religions imposent de cacher certaines parties du corps, qui varient d'une religion &agrave; l'autre, afin d'&eacute;viter d'exposer autrui &agrave; la tentation d'un acte qui pr&eacute;senterait un risque &agrave; la fois pour l'individu et pour l'esp&egrave;ce.<br>
On peut opposer &agrave; ces r&egrave;gles un certain nombre d'arguments :<br>
<ul>
<li> A l'&eacute;poque o&ugrave; les grandes religions monoth&eacute;istes sont apparues, les  pr&eacute;servatifs n'existaient pas, mais maintenant quand on en utilise on peut consid&eacute;rer qu'on ne fait pas vraiment l'amour puisqu'il n'y a pas de contact sexuel v&eacute;ritable, et par cons&eacute;quent que les r&egrave;gles des religions ne s'appliquent pas.<br>
A l'&eacute;poque, les hommes &eacute;taient peu nombreux, il &eacute;tait important de croitre et multiplier et de ne pas gaspiller la semence, mais maintenant le risque viendrait plutot de la surpopulation. 
<li>On peut aussi consid&eacute;rer qu'il est raisonnable de cacher les parties genitales mais pas la t&ecirc;te.<br>
Mais un &eacute;tat peut-il d&eacute;cr&eacute;ter des normes en mati&egrave;re de pratique religieuse? Je pense que c'est &agrave; chacun de d&eacute;cider en fonction de ses convictions personnelles.<br>
</ul>
<br>
<br>
<br>
<br>

</BODY></HTML>
